# 2018 - 09 - 27 (jueves)

### Entrega proyectos

---

# SQL

La clase pasada cargamos una base de datos con 2 tablas:
- mis_datos
- tabla_nombres

Descargar aqui si no la tienen: https://www.dropbox.com/s/tejs4qpkp06q3ka/data_sql.db?dl=0

In [9]:
#probar esta celda, para ver si tienen libreria pymysql
import pymysql.cursors

### Carga datos clase pasada

In [ ]:
import pandas as pd
import sqlite3

#leo los datos
db_path = r'../clase11_20180925/data_sql.db'
db_conn = sqlite3.connect(db_path)

"Veamos" los datos primero...

In [5]:
sql_query = ''

data = pd.read_sql(sql_query, db_conn)
display(data)

   index  year  quarter  valor
0      0  2010        1      3
1      1  2010        2      6
2      2  2010        3      8
3      3  2010        4      1
4      4  2011        1      4
5      5  2011        2      3
6      6  2011        3      7
7      7  2011        4     70

Ejercicio clase pasada: "Calcule el promedio de "valor" para cada año, considerando sólo el "valor" de los dos primeros trimestres de cada año."

In [ ]:
sql_query = ''

data = pd.read_sql(sql_query, db_conn)
display(data)

### Ejemplos "join"

Calcule el promedio de "valor" para cada trimestre, usando el nombre del trimestre

```
SELECT nombre, AVG(valor)
FROM mis_datos
    INNER JOIN tabla_nombres ON mis_datos.quarter = tabla_nombres.quarter
GROUP BY nombre

```

Identifique los años/trimestres (con el "nombre" del trimestre) donde "valor" haya sido mayor a 5

```
SELECT year, nombre
FROM mis_datos
    INNER JOIN tabla_nombres ON mis_datos.quarter = tabla_nombres.quarter
WHERE valor > 5

```

In [6]:
sql_query = '''
    SELECT year, nombre
    FROM mis_datos
        INNER JOIN tabla_nombres ON mis_datos.quarter = tabla_nombres.quarter
    WHERE valor > 5
'''

data = pd.read_sql(sql_query, db_conn)
display(data)

   year   nombre
0  2010  Segundo
1  2010  Tercero
2  2011  Tercero
3  2011   Cuarto

# Un ejemplo más real...

In [8]:
#usando datos en servidor
import pandas as pd
import pymysql.cursors

from IPython.display import display

host = '190.107.176.7'
user = 'reportej_alum'
passwd = 'clave_alumno2018'
database = 'reportej_eae253b'

# Connect to the database
connection = pymysql.connect(host=host,
                             user=user,
                             password=passwd,
                             db=database,)

query = '''
    select count(*)
    from casen
'''

df_cuenta = pd.read_sql(query, connection)

display(df_cuenta)

OperationalError: (2003, "Can't connect to MySQL server on '190.107.176.7' (timed out)")

### SQL Injection

In [16]:
sql_query = '''
    SELECT year, nombre
    FROM mis_datos
        INNER JOIN tabla_nombres USING (quarter)
    WHERE valor > ?
'''

data = pd.read_sql(sql_query, db_conn, params=[3])
display(data)

   year   nombre
0  2010  Segundo
1  2010  Tercero
2  2011  Primero
3  2011  Tercero
4  2011   Cuarto